In [2]:
import pandas as pd
import numpy as np

In [11]:
data = [[256.5,770.6,363.5,139.3],
        [264.3,567.5,231.2,59.9],
        [215.9,599.8,293.1,76.9],
        [223.2,387.1,247.7,109.1],
        [312.8,446.2,381.6,108.1]]

frame = pd.DataFrame(data,
                    index = ['2012', '2013', '2014', '2015', '2016'],
                    columns = ['봄','여름','가을','겨울'])

frame

          봄     여름     가을     겨울
2012  256.5  770.6  363.5  139.3
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1

In [12]:
frame.head(3)

          봄     여름     가을     겨울
2012  256.5  770.6  363.5  139.3
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9

In [13]:
frame.tail(3)

          봄     여름     가을     겨울
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1

In [14]:
frame[2:4]

          봄     여름     가을     겨울
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1

In [15]:
frame.loc['2014']

봄     215.9
여름    599.8
가을    293.1
겨울     76.9
Name: 2014, dtype: float64

In [21]:
frame.loc['2013':'2015'] # A 이상 B 이하로 나옴 (미만이 아님을 주의)

          봄     여름     가을     겨울
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1

In [22]:
frame['봄']

2012    256.5
2013    264.3
2014    215.9
2015    223.2
2016    312.8
Name: 봄, dtype: float64

In [23]:
frame[['봄','가을']] # 반드시 list 로 넣어줄것

          봄     가을
2012  256.5  363.5
2013  264.3  231.2
2014  215.9  293.1
2015  223.2  247.7
2016  312.8  381.6

In [27]:
frame[['봄','가을']]['2014':'2015'] # column 먼저 slicing 후 index slicing

          봄     가을
2014  215.9  293.1
2015  223.2  247.7

# Data Merge

#인덱스 증가 방향으로 병합
#columns 증가 방향으로 병합
#공통된 열(key)를 중심으로 좌우로 병합

In [40]:
# 인덱스 증가 방향으로 병합
data2 = [[1,2,3,4]]
frame2 = pd.DataFrame(data2,
                     index = ['2017'],
                     columns = ['봄','여름','가을','겨울'])
frame.append(frame2)

          봄     여름     가을     겨울
2012  256.5  770.6  363.5  139.3
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1
2017    1.0    2.0    3.0    4.0

In [48]:
# 인덱스 증가 방향으로 병합2
df1 = pd.DataFrame({'class1':[95,92,98,100],
                   'class2':[91,93,97,99]})
df1

   class1  class2
0      95      91
1      92      93
2      98      97
3     100      99

In [49]:
df2 = pd.DataFrame({'class1' : [96,83]})
df2

   class1
0      96
1      83

In [50]:
df1.append(df2,ignore_index = True) # ignore_index 하면 붙혀넣을때 붙혀넣어지는것의 index 를 무시하고 index 가 기존의 데이터에 이어지게 수정이 됨.

   class1  class2
0      95    91.0
1      92    93.0
2      98    97.0
3     100    99.0
4      96     NaN
5      83     NaN

In [51]:
# columns 증가 방향으로 병합
df3 = pd.DataFrame({'class3':[93,95,12,95]})
df3

   class3
0      93
1      95
2      12
3      95

In [52]:
df1

   class1  class2
0      95      91
1      92      93
2      98      97
3     100      99

In [53]:
df1.join(df3)

   class1  class2  class3
0      95      91      93
1      92      93      95
2      98      97      12
3     100      99      95

In [65]:
# 공통된 열(key)를 중심으로 좌우로 병합 => 특정 열을 기준으로 통합: 두 데이터가 공유하는 칼럼을 기준으로 데이터가 통합1

df1 = pd.DataFrame({'판매월':['1월','2월','3월','4월'],
                   '제품A':[91,93,97,99]})

df2 = pd.DataFrame({'판매월':['1월','2월','3월','4월'],
                   '제품B':[4,67,1,77]})

In [66]:
df1

  판매월  제품A
0  1월   91
1  2월   93
2  3월   97
3  4월   99

In [67]:
df2

  판매월  제품B
0  1월    4
1  2월   67
2  3월    1
3  4월   77

In [68]:
df1.merge(df2)

  판매월  제품A  제품B
0  1월   91    4
1  2월   93   67
2  3월   97    1
3  4월   99   77

In [69]:
# 공통된 열(key)를 중심으로 좌우로 병합 => 특정 열을 기준으로 통합: 두 데이터가 공유하는 칼럼을 기준으로 데이터가 통합2

df1 = pd.DataFrame({'판매월':['1월','2월','3월','4월'],
                   '제품A':[91,93,97,99]})

df2 = pd.DataFrame({'판매월':['1월','2월','3월','5월'],
                   '제품B':[4,67,1,3]})

In [70]:
df1

  판매월  제품A
0  1월   91
1  2월   93
2  3월   97
3  4월   99

In [71]:
df2

  판매월  제품B
0  1월    4
1  2월   67
2  3월    1
3  5월    3

In [82]:
df1.merge(df2, how ='left', on ='판매월') #앞선 데이터를 기준으로 표시

  판매월  제품A   제품B
0  1월   91   4.0
1  2월   93  67.0
2  3월   97   1.0
3  4월   99   NaN

In [83]:
df1.merge(df2, how ='right', on ='판매월') #나중 데이터를 기준으로 표시

  판매월   제품A  제품B
0  1월  91.0    4
1  2월  93.0   67
2  3월  97.0    1
3  5월   NaN    3

In [84]:
df1.merge(df2, how ='outer', on ='판매월') #모든 것

  판매월   제품A   제품B
0  1월  91.0   4.0
1  2월  93.0  67.0
2  3월  97.0   1.0
3  4월  99.0   NaN
4  5월   NaN   3.0

In [85]:
df1.merge(df2, how ='inner', on ='판매월') # 공통된 것만

  판매월  제품A  제품B
0  1월   91    4
1  2월   93   67
2  3월   97    1